Autodesk.Revit.DB.Mechanical.Space.IsPointInSpace(Autodesk.Revit.DB.XYZ)
Determines if a point lies within the volume of the Space.
point: Point to be checked.
Returns true if the point is in the Space, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the point is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The coordinates of the point is not a number.

Autodesk.Revit.DB.Mechanical.Space.Plenum
Reports whether this zone is Plenum or not.

Autodesk.Revit.DB.Mechanical.Space.Occupiable
Reports whether this zone is Occupiable or not.

Autodesk.Revit.DB.Mechanical.Space.DesignPowerLoad
Get or set the Design Power Load of the Space.
Remarks: This property is used to get or set the Design Power Load of the Space.

Autodesk.Revit.DB.Mechanical.Space.ActualPowerLoad
Get the Actual Power Load of the Space.
Remarks: This property is used to get  the Actual Power Load of the Space.

Autodesk.Revit.DB.Mechanical.Space.PowerLoadUnit
Get or set the Power Load Unit of the Space.
Remarks: This property is used to get or set the Power Load Unit of the Space.

Autodesk.Revit.DB.Mechanical.Space.DesignLightingLoad
Get or set the Design Lighting Load of the Space.
Remarks: This property is used to get or set the Design Lighting Load of the Space.

Autodesk.Revit.DB.Mechanical.Space.ActualLightingLoad
Get the Actual Lighting Load of the Space.
Remarks: This property is used to get the Actual Lighting Load of the Space.

Autodesk.Revit.DB.Mechanical.Space.LightingLoadUnit
Get or set the Lighting Load Unit of the Space.
Remarks: This property is used to get or set the Lighting Load Unit of the Space.

Autodesk.Revit.DB.Mechanical.Space.LatentHeatGainperPerson
Get or set the Latent Heat Gain per Person of the Space.
Remarks: This property is used to get or set the Latent Heat Gain per Person of the Space.

Autodesk.Revit.DB.Mechanical.Space.SensibleHeatGainperPerson
Get or set the Sensible Heat Gain per Person of the Space.
Remarks: This property is used to get or set the Sensible Heat Gain per Person of the Space.

Autodesk.Revit.DB.Mechanical.Space.AreaperPerson
Get or set the Area per Person of the Space.
Remarks: This property is used to get or set Area per Person of the Space.

Autodesk.Revit.DB.Mechanical.Space.NumberofPeople
Get or set the Number of People of the Space.
Remarks: This property is used to get or set Number of People of the Space.

Autodesk.Revit.DB.Mechanical.Space.BaseHeatLoadOn
The heat load-on.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the values is not kUseDefaultLoad or kUseEnteredLoad.

Autodesk.Revit.DB.Mechanical.Space.OccupancyUnit
Get or set the Occupancy Unit of the Space.
Remarks: This property is used to get or set the Occupancy Unit of the Space.

Autodesk.Revit.DB.Mechanical.Space.DesignCoolingLoad
Get or set the Design Cooling Load of the Space.
Remarks: This property is used to get or set the Design Cooling Load of the Space.

Autodesk.Revit.DB.Mechanical.Space.CalculatedCoolingLoad
Get the Calculated Cooling Load of the Space.
Remarks: This property is used to get  the Calculated Cooling Load of the Space.

Autodesk.Revit.DB.Mechanical.Space.DesignHeatingLoad
Get or set the Design Heating Load of the Space.
Remarks: This property is used to get or set the Design Heating Load of the Space.

Autodesk.Revit.DB.Mechanical.Space.CalculatedHeatingLoad
Get the Calculated Heating Load of the Space.
Remarks: This property is used to get  the Calculated Heating Load of the Space.

Autodesk.Revit.DB.Mechanical.Space.SpaceConstruction
Get the Space Construction of the Space.
Remarks: This property is used to get the Space Construction of the Space.

Autodesk.Revit.DB.Mechanical.Space.SpaceTypeId
Get or set the Space type element of the Space.
Remarks: This property is used to get or set the Space type of the Space.

Autodesk.Revit.DB.Mechanical.Space.SpaceType
Get or set the Space type of the Space.
Remarks: This property is used to get or set the Space type of the Space.

Autodesk.Revit.DB.Mechanical.Space.ConditionType
Get or set the Condition type of the Space.
Remarks: This property is used to get or set the Condition type of the Space.

Autodesk.Revit.DB.Mechanical.Space.Volume
Get the Volume of the Space.
Remarks: This property is used to get the Volume of the Space.

Autodesk.Revit.DB.Mechanical.Space.UnboundedHeight
Get the Unbounded Height of the Space.
Remarks: This property is used to get the Unbounded Height of the Space.

Autodesk.Revit.DB.Mechanical.Space.OutdoorAirFlowStandard
Get the OutdoorAirFlowStandard of the Space.
Remarks: This property is used to get the OutdoorAirFlowStandard of the Space.

Autodesk.Revit.DB.Mechanical.Space.OutdoorAirflow
Get the Outdoor Airflow of the Space.
Remarks: This property is used to get the Outdoor Airflow (Unit: ft3/s) of the Space.

Autodesk.Revit.DB.Mechanical.Space.AirChangesPerHour
Get the Specified AirChangesPerHour of the Space.
Remarks: This property is used to get the Specified AirChangesPerHour of the Space.

Autodesk.Revit.DB.Mechanical.Space.OutdoorAirPerArea
Get the Specified OutdoorAirPerArea of the Space.
Remarks: This property is used to get the Specified OutdoorAirPerArea (Unit: ft/s) of the Space.

Autodesk.Revit.DB.Mechanical.Space.OutdoorAirPerPerson
Get the Specified OutdoorAirPerPerson of the Space.
Remarks: This property is used to get the Specified OutdoorAirPerPerson (Unit: ft3/s) of the Space.

Autodesk.Revit.DB.Mechanical.Space.ActualExhaustAirflow
Get the Actual Exhaust Airflow of the Space.
Remarks: This property is used to get the Actual Exhaust Airflow (Unit: CFM) of the Space.

Autodesk.Revit.DB.Mechanical.Space.DesignExhaustAirflow
Get or set the Specified Exhaust Airflow of the Space.
Remarks: This property is used to get or set the Specified Exhaust Airflow (Unit: CFM) of the Space.

Autodesk.Revit.DB.Mechanical.Space.ActualReturnAirflow
Get the Actual Return Airflow of the Space.
Remarks: This property is used to get the Actual Return Airflow (Unit: CFM) of the Space.

Autodesk.Revit.DB.Mechanical.Space.DesignReturnAirflow
Get or set the Specified Return Airflow of the Space.
Remarks: This property is used to get or set the Specified Return Airflow (Unit: CFM) of the Space.

Autodesk.Revit.DB.Mechanical.Space.ReturnAirflow
Get or set the Return type of Supply Airflow of the Space.
Remarks: This property is used to get or set the Return type of Supply Airflow of the Space.

Autodesk.Revit.DB.Mechanical.Space.ActualSupplyAirflow
Get the Actual Supply Airflow of the Space.
Remarks: This property is used to get the Actual Supply Airflow (Unit: CFM) of the Space.

Autodesk.Revit.DB.Mechanical.Space.CalculatedSupplyAirflow
Get the Calculated Supply Airflow of the Space.
Remarks: This property is used to get the Calculated Supply Airflow (Unit: CFM) of the Space.

Autodesk.Revit.DB.Mechanical.Space.DesignSupplyAirflow
Get or set the Specified Supply Airflow of the Space.
Remarks: This property is used to get or set the Specified Supply Airflow (Unit: CFM) of the Space.

Autodesk.Revit.DB.Mechanical.Space.ActualOtherLoad
Get the Actual Other Load of the Space.
Remarks: This property is used to get the Actual Other Load (Unit: W) of the Space.

Autodesk.Revit.DB.Mechanical.Space.DesignOtherLoadperArea
Get or set the Design Other Load per Area of the Space.
Remarks: This property is used to get or set the Design Other Load per Area (Unit: W/ft2) of the Space.

Autodesk.Revit.DB.Mechanical.Space.ActualHVACLoad
Get the Actual HVAC Load of the Space.
Remarks: This property is used to get the Actual HVAC Load (Unit: W) of the Space.

Autodesk.Revit.DB.Mechanical.Space.DesignHVACLoadperArea
Get or set the Design HVAC Load per Area of the Space.
Remarks: This property is used to get or set the Design HVAC Load per Area (Unit: W/ft2) of the Space.

Autodesk.Revit.DB.Mechanical.Space.FloorReflectance
Get or set the Floor Reflectance of the Space.
Remarks: This property is used to get or set the Floor Reflectance of the Space.

Autodesk.Revit.DB.Mechanical.Space.WallReflectance
Get or set the Wall Reflectance of the Space.
Remarks: This property is used to get or set the Wall Reflectance of the Space.

Autodesk.Revit.DB.Mechanical.Space.CeilingReflectance
Get or set the Ceiling Reflectance of the Space.
Remarks: This property is used to get or set the Ceiling Reflectance of the Space.

Autodesk.Revit.DB.Mechanical.Space.LightingCalculationWorkplane
Get or set the Lighting Calculation Workplane of the Space.
Remarks: This property is used to get or set the Lighting Calculation Workplane (Unit: feet) of the Space.

Autodesk.Revit.DB.Mechanical.Space.SpaceCavityRatio
Get the Space Cavity Ratio of the Space.
Remarks: This property is used to get the Space Cavity Ratio of the Space.

Autodesk.Revit.DB.Mechanical.Space.AverageEstimatedIllumination
Get the Average Estimated Illumination of the Space.
Remarks: This property is used to get the Average Estimated Illumination of the Space. (Unit: fc)

Autodesk.Revit.DB.Mechanical.Space.BaseOffset
Get or set the Base Offset of the Space.
Remarks: This property is used to get or set the Base Offset of the Space.

Autodesk.Revit.DB.Mechanical.Space.LimitOffset
Get or set the Limit Offset of the Space.
Remarks: This property is used to get or set the Limit Offset of the Space.

Autodesk.Revit.DB.Mechanical.Space.UpperLimit
Get or set the Upper Limit of the Space.
Remarks: This property is used to get or set the Upper Limit of the Space.

Autodesk.Revit.DB.Mechanical.Space.Room
Return the Room of the space.

Autodesk.Revit.DB.Mechanical.Space.ClosedShell
Return the closedShell of the space.

Autodesk.Revit.DB.Mechanical.Space.Zone
Reports this space belong to which Zone.
Remarks: This property is used to retrieve the host zone of this space.

Autodesk.Revit.DB.Mechanical.Space
Provides access to the space topology in Autodesk Revit.
Remarks: The space object can be queried for its boundary for use in space planning tools.